chipKIT32/chipKIT-core/pic32/boards.txt
CUI32stem.menu.USB.a_cdcacm=Serial
CUI32stem.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
CUI32stem.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
CUI32stem.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
CUI32stem.menu.USB.z_custom=Custom / Disabled
CUI32stem.menu.USB.z_custom.build.extra_flags=

ubw32_mx795.menu.USB.a_cdcacm=Serial
ubw32_mx795.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
ubw32_mx795.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
ubw32_mx795.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
ubw32_mx795.menu.USB.z_custom=Custom / Disabled
ubw32_mx795.menu.USB.z_custom.build.extra_flags=

cui32.menu.USB.a_cdcacm=Serial
cui32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
cui32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
cui32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
cui32.menu.USB.z_custom=Custom / Disabled
cui32.menu.USB.z_custom.build.extra_flags=

cerebot_mx7ck.menu.USB.z_custom=Custom / Disabled
cerebot_mx7ck.menu.USB.z_custom.build.extra_flags=
cerebot_mx7ck.menu.USB.a_cdcacm=Serial
cerebot_mx7ck.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
cerebot_mx7ck.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
cerebot_mx7ck.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

fubarino_sd_seeed.menu.USB.a_cdcacm=Serial
fubarino_sd_seeed.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
fubarino_sd_seeed.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
fubarino_sd_seeed.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
fubarino_sd_seeed.menu.USB.z_custom=Custom / Disabled
fubarino_sd_seeed.menu.USB.z_custom.build.extra_flags=

